CASE STUDY
RPG Program:
0001.00 H                                                                       
0002.00 FDLEAVEMGMTCF   E             WORKSTN                                   
0002.01 F                                     SFILE(ADMSFLDATA:RRN1)            
0002.02 F                                     SFILE(HLDDATA:RRN2)               
0002.03 F                                     SFILE(DELSFLDATA:RRN3)            
0002.04 F                                     SFILE(LEAVEDATA:RRN4)             
0002.05 F                                     SFILE(COMPDATA:RRN5)              
0002.06 F                                     SFILE(MNGDATA:RRN6)               
0002.07 F                                     SFILE(COMPDSDATA:RRN7)            
0002.08 F                                     SFILE(LVADDATA:RRN8)              
0002.09 F                                     SFILE(VIEWHDATA:RRN9)             
0002.10 FLOGINPF   UF A E           K DISK                                      
0002.11 FLEAVESPF  UF A E           K DISK                                      
0003.00 FEMPMASTER UF A E           K DISK                                      
0004.01 FHOLIDAYPF UF A E           K DISK                                      
0004.02 FCOMPOFFPF UF A E           K DISK                                      
0004.03 FLEAVEBALPFUF A E           K DISK                                      
0005.00 DRRN1             S              4S 0                                   
0005.01 DRRN2             S              4S 0      
0005.02 DRRN3             S              4S 0                                    
0005.03 DRRN4             S              4S 0                                    
0005.04 DRRN5             S              4S 0                                    
0005.05 DRRN6             S              4S 0                                    
0005.06 DRRN7             S              4S 0                                    
0005.07 DRRN8             S              4S 0                                    
0005.08 DRRN9             S              4S 0                                    
0006.02 D date1           S               D                                      
0006.03 D Flag            S               N   INZ(*off)                          
0006.04 D Flag2           S               N   INZ(*off)                          
0006.05 D days_num        S              3S 0                                    
0006.06 D months_num      S              2S 0                                    
0006.07 D years_num       S              2S 0                                    
0006.08 D date_num        S                   LIKE(DDOB)                         
0006.09 DTempLeaveType    S              2A                                      
0006.10 DTempPwd          S                   LIKE(PWD)                          
0006.11 DDigits           C                   '0123456789'                       
0006.12 DAlpha            C                   'ABCDEFGHIJKLMNOPQRSTUVWXYZ'       
0007.00  *                                                                       
0008.00  /free                                                                   
0008.01        ExSr $CheckSr;                      
0009.00        DoW *in03 = *off;                   
0010.00          ExFmt MAIN;                       
0011.00          ExSr $LoginSr;                    
0012.00        EndDo;                              
0013.00        *inlr = *on;                        
0014.00                                            
0015.00        BegSr $LoginSr;                     
0015.01          ExSr $CheckSr;                    
0016.00          Chain DUSERM LOGINPF;             
0017.00          if %found(LOGINPF);               
0017.01            *in95 = *off;                   
0017.02            Clear ERRMSG;                   
0017.03            Chain DUSERM EMPMASTER;         
0017.04            If %found(EMPMASTER);           
0017.05            Select;                         
0017.06            When ROLE = 'A';                
0018.00              If (DPWDM = PWD);             
0018.01                *in96 = *off;               
0018.02                Clear DUSERM;               
0018.03                Clear DPWDM;                        
0019.00                ExSr $ClearSr;                      
0020.00                ExSr $LoadSr;                       
0021.00                Write ADMFOOTER;                    
0022.06                ExSr $ADMIN;                        
0022.09              Else;                                 
0022.10                *in96 = *on;                        
0022.11                ERRMSG = 'Password not correct';    
0022.12              Endif;                                
0022.14            When ROLE = 'M';                        
0022.15              If DPWDM = PWD;                       
0022.16                *in96 = *off;                       
0022.17                ExSr $Manager;                      
0022.18                Clear DUSERM;                       
0022.19                Clear DPWDM;                        
0022.30              Else;                                 
0022.31                *in96 = *on;                        
0022.32                ERRMSG = 'Password not correct';    
0022.33              Endif;                                
0022.35            When ROLE = 'E';                        
0022.36            If DPWDM = PWD;                     
0022.37             *in96 = *off;                      
0022.38             ExSr $Employee;                    
0025.02             Clear DUSERM;                      
0025.03             Clear DPWDM;                       
0025.04            Else;                               
0025.05              *in96 = *off;                     
0025.06              ERRMSG = 'Password not correct';  
0025.07            EndIf;                              
0025.08        EndSl;                                  
0025.09        EndIf;                                  
0025.10          Else;                                 
0025.11             *in95 = *on;                       
0025.12             ERRMSG = 'User id not valid';      
0026.00        endif;                                  
0027.00        EndSr;                                  
0028.00                                                
0029.00        BegSr $ClearSr;                         
0030.00          *in50 = *off;                         
0031.00          Write ADMSFLCTL;                      
0032.00          *in50 = *on;                    
0033.00          RRN1 = 0;                       
0034.00        EndSr;                            
0035.00                                          
0036.00        BegSr $LoadSr;                    
0037.00          Setll *loval empmaster;         
0038.00          Read empmaster;                 
0039.00          Dow not %eof(empmaster);        
0040.00            RRN1 = RRN1 + 1;              
0041.00            Write ADMSFLDATA;             
0042.00            Read empmaster;               
0043.00          Enddo;                          
0043.02          Clear ERRMSGADM;                
0044.00        EndSr;                            
0044.01                                          
0044.02        Begsr $ADMIN;                     
0044.03          Clear ERRMSGADM;                
0044.04          DoW *in03 = *off;               
0044.05            Write ADMFOOTER;              
0044.06            ExFmt ADMSFLCTL;              
0044.07            ReadC ADMSFLDATA;               
0044.08            Select;                         
0044.09            When *in05 = *on;               
0044.10              *in05 = *off;                 
0044.11              ADMOPT = 0;                   
0044.12              Clear ERRMSGADM;              
0044.13              ExSr $ClearSr;                
0044.14              ExSr $LoadSr;                 
0044.15            When *in12 = *on;               
0044.16              *in12 = *off;                 
0044.17              LeaveSr;                      
0044.18            When *in06 = *on;               
0044.19              *in06 = *off;                 
0044.20              ExSr $Addsr;                  
0044.21              iter;                         
0044.22            When *in07 = *on;               
0044.23              *in07 = *off;                 
0044.24              ExSr $AddHldSr;               
0044.25              iter;                         
0044.26            When *in10 = *on;               
0044.27              *in10 = *off;                                                 
0044.28              ExSr $ViewHldSr;                                              
0044.29              iter;                                                         
0044.30            When ADMOPT = 2;                                                
0044.31              ADMOPT = 0;                                                   
0044.32              ExSr $EdtSr;                                                  
0044.33              ExSr $ClearSr;                                                
0044.34              ExSr $LoadSr;                                                 
0044.35              iter;                                                         
0044.36            When ADMOPT = 4;                                                
0044.37              ADMOPT = 0;                                                   
0044.38              ExSr $DelSr;                                                  
0044.39              iter;                                                         
0044.40            When ADMOPT = 5;                                                
0044.41              ADMOPT = 0;                                                   
0044.42              ExSr $ViewSr;                                                 
0044.43              ExSr $ClearSr;                                                
0044.44              ExSr $LoadSr;                                                 
0044.45              iter;                                                         
0044.46            When ADMOPT <> 0 and(ADMOPT <> 2 or ADMOPT <> 4 or ADMOPT <> 5);
0044.47              ERRMSGADM = 'Wrong option entered';            
0044.48              iter;                                          
0044.49            Other;                                           
0044.50              ERRMSGADM = 'Invalid function key';            
0044.51            EndSl;                                           
0044.53          EndDo;                                             
0044.54          *in03 = *off;                                      
0044.56        EndSr;                                               
0044.57                                                             
0044.58        BegSr $Employee;                                     
0044.59          Clear EMPRCD;                                      
0044.60              Dow *in03 = *off;                              
0044.61                USER = 'Employee';                           
0044.62                HEADING = 'Employee Dashboard';              
0044.63                Write HEADER;                                
0044.64                Write FOOTER;                                
0044.65                ExFmt EMPRCD;                                
0044.66                Select;                                      
0044.67                When *in05 = *on;                            
0044.68                  *in05 = *off;                              
0044.69                  Clear SELE;                      
0044.70                  Clear ERRMSG5;                   
0044.71                  iter;                            
0044.72                When *in12 = *on;                  
0044.73                  *in12 = *off;                    
0044.74                  LeaveSr;                         
0044.75                When SELE = '1';                   
0044.76                  ExSr $ApplyCompSr;               
0044.77                  iter;                            
0044.78                When SELE = '2';                   
0044.79                  ExSr $ApplyLeave1Sr;             
0044.80                  iter;                            
0044.81                When SELE = '3';                   
0044.82                  Clear SELE;                      
0044.83                  ExSr $LeaveStatusSr;             
0044.84                When SELE = '4';                   
0044.85                  Clear SELE;                      
0044.86                  ExSr $CompStatusSr;              
0044.87                When SELE = '5';                   
0044.88                  Clear SELE;                      
0044.89                  ExSr $ViewHolidaySr;                                     
0044.90                When SELE = '6';                                           
0044.91                  Clear SELE;                                              
0044.92                  ExSr $UpdPwdSr;                                          
0044.93                When SELE = '7';                                           
0044.94                  Clear SELE;                                              
0044.95                  *in03 = *on;                                             
0044.96                When SELE <> *blanks and not (SELE >= '1' and SELE <= '7');
0044.97                  ERRMSG5 = 'Wrong Option entered';                        
0044.98                  Clear SELE;                                              
0044.99                Other;                                                     
0045.00                  Clear SELE;                                              
0045.01                  ERRMSG5 = 'Invalid Function Key';                        
0045.02                EndSl;                                                     
0045.03              enddo;        
0045.04              *in03 = *off; 
0045.05        EndSr;     
0045.10        BegSr $Manager;                        
0045.11          Clear MNGRCD;                        
0045.12          Clear ERRMSG5;                       
0045.13             Dow *in03 = *off;                 
0045.14                USER = 'Manager';              
0045.15                HEADING = 'Manager Dashboard'; 
0045.16                DTEAM = TEAM;                  
0045.17                Write HEADER;                  
0045.18                Write FOOTER;                  
0045.20                ExFmt MNGRCD;                     
0045.21                Select;                           
0045.22                When *in05 = *on;                 
0045.23                  *in05 = *off;                   
0045.25                  Clear SEL;                      
0045.26                When *in12 = *on;                 
0045.27                  *in12 = *off;                   
0045.28                  LeaveSr;                        
0045.29                When SEL = 1;                     
0045.30                  Clear SEL;                      
0045.32                  ExSr $ClearMngSr;               
0045.33                  ExSr $LoadMngSr;                
0045.34                  Write HEADER;                   
0045.35                  Write FOOTER;                   
0045.36                  ExSr $ManagerDataSr;            
0045.37                  iter;                           
0045.38                When SEL = 2;                     
0045.39                  Clear SEL;                      
0045.41                  ExSr $ClearLeaveADSr;           
0045.42                  ExSr $LoadLeaveADSr;            
0045.43                  Write HEADER;                   
0045.44                  Write FOOTER;                   
0045.45                  ExSr $ManagerLeaveSr;           
0045.46                  iter;                           
0045.47                When SEL = 3;                     
0045.48                  Clear SEL;                      
0045.50                  ExSr $ClearCompADSr;            
0045.51                  ExSR $LoadCompADSr;             
0045.52                  Write HEADER;                   
0045.53                  Write FOOTER;                   
0045.54                  ExSr $ManagerCompSr;            
0045.55                  iter;                           
0045.56                When SEL = 4;                     
0045.57                  Clear SEL;                      
0045.59                  Write HEADER;                   
0045.60                  ExSr $ApplyCompSr;              
0045.61                  iter;                           
0045.62                When SEL = 5;                     
0045.63                  Clear ERRMSG5;                  
0045.64                  Clear SEL;                      
0045.65                  Write HEADER;                        
0045.66                  ExSr $ApplyLeave1Sr;                 
0045.67                  iter;                                
0045.68                When SEL = 6;                          
0045.69                  Clear SEL;                           
0045.71                  Write HEADER;                        
0045.72                  ExSr $LeaveStatusSr;                 
0045.73                  iter;                                
0045.74                When SEL = 7;                          
0045.75                  Clear SEL;                           
0045.77                  Write HEADER;                        
0045.78                  ExSr $CompStatusSr;                  
0045.79                  iter;                                
0045.80                When SEL = 8;                          
0045.81                  Clear SEL;                           
0045.83                  Write HEADER;                        
0045.84                  Write FOOTER;                        
0045.85                  ExSr $ViewHolidaySr;                 
0045.86                  iter;                                
0045.87                When SEL = 9;                          
0045.88                  Clear SEL;                           
0045.90                  Write HEADER;                        
0045.91                  ExSr $UpdPwdSr;                      
0045.92                  iter;                                
0045.93                When SEL = 10;                         
0045.94                  Clear SEL;                           
0045.96                  *in03 = *on;                         
0045.97                  iter;                                
0045.98                When not (SEL>=1 and SEL<=10);         
0045.99                  Clear SEL;                           
0046.01                  ERRMSG5 = 'Wrong option pressed';    
0046.02                  iter;                                
0046.03                EndSl;                                 
0046.04              endDo;                                   
0046.05              *in03 = *off;                            
0046.06        EndSr;                                         
0046.07                                                       
0046.08        Begsr $AddSr;                                  
0046.09          Clear ERRMSG1;                               
0046.11        Dow *in03 = *off;                              
0046.12          SetGt *Hival EMPMASTER;                 
0046.13          ReadP EMPMASTER;                        
0046.14          DID = ID + 1;                           
0046.15          ExFmt ADDRCD;                           
0046.16          ExSr $CheckSr;                          
0046.18          Select;                                 
0046.19          When *in12 = *on;                       
0046.20            *in12 = *off;                         
0046.21            LeaveSr;                              
0046.22          When *in05 = *on;                       
0046.23            *in05 = *off;                         
0046.24            Clear ERRMSG1;                        
0046.25            ExSr $EmpDetailSr;                    
0047.00          When *in04 = *on and csrfld = 'DGEN';   
0048.00            *in04 = *off;                         
0049.00            ExFmt GENWIN;                         
0051.00            If SELG = 1;                          
0052.00              DGEN = 'M';                         
0053.00            Else;                                 
0054.00              DGEN = 'F';                         
0055.00            EndIf;                                 
0055.01            iter;                                  
0055.02          When *in04 = *on and csrfld = 'DTEAM';   
0055.03            *in04 = *off;                          
0055.04            ExFmt TEAMWIN;                         
0055.05            If SELT = 1;                           
0055.06              DTEAM = 'RPG';                       
0055.07              DPID = 'RPG123';                     
0055.08              DMID = 106;                          
0055.09            ElseIf SELT = 2;                       
0055.10              DTEAM = 'JAVA';                      
0055.11              DPID = 'JAVA123';                    
0055.12              DMID = 107;                          
0055.13            ElseIf SELT = 3;                       
0055.14              DTEAM = 'PYTHON';                    
0055.15              DPID = 'PTH1';                       
0055.16              DMID = 108;                          
0055.17            ElseIf SELT = 4;                       
0055.18              DTEAM = 'C++';                       
0055.19              DPID = 'CPP1';                       
0055.20              DMID = 109;                            
0055.21            ElseIf SELT = 5;                         
0055.22              DTEAM = 'ML';                          
0055.23              DPID = 'ML1';                          
0055.24              DMID = 110;                            
0055.25            Else;                                    
0055.26              DTEAM = 'RUBY';                        
0055.27              DPID = 'RUBY1';                        
0055.28              DMID = 111;                            
0055.29            EndIf;                                   
0055.30            iter;                                    
0055.31          When *in04 = *on and csrfld = 'DSTATUS';   
0055.32            *in04 = *off;                            
0055.33            ExFmt STATUSWIN;                         
0055.34            If SELS = 1;                             
0055.35              DSTATUS = 'A';                         
0055.36            Else;                                    
0055.37              DSTATUS = 'I';                         
0055.38            EndIf;                                   
0055.39            iter;       
0055.40          When *in04 = *on and csrfld = 'DROLE';                          
0055.41            *in04 = *off;                                                 
0055.42            ExFmt ROLEWIN;                                                
0055.43            If SELR = 1;                                                  
0055.44              DROLE = 'A';                                                
0055.45            ElseIf SELR = 2;                                              
0055.46              DROLE = 'M';                                                
0055.47            Else;                                                         
0055.48              DROLE = 'E';                                                
0055.49            EndIf;                                                        
0055.50            iter;                                                         
0055.55           When not (DNAME >= 'A' and DNAME <= 'Z');                      
0055.56             *in25 = *on;                                                 
0055.57             ERRMSG1 = 'Only alphabets allowed in name field';            
0055.58             iter;                                                        
0055.59           When not (DCITY >= 'A' and DCITY <= 'Z');                      
0055.60             *in27 = *on;                                                 
0055.61             ERRMSG1 = 'Only alphabets allowed in city field';            
0055.62             iter;                                                        
0055.63           When DDOB = 0;                                                 
0055.64             *in28 = *on;                                                      
0055.65             ERRMSG1 = 'Enter Date of Birth';                                  
0055.66             iter;                                                             
0055.67           When DDOJ = 0;                                                      
0055.68             *in29 = *on;                                                      
0055.69             ERRMSG1 = 'Enter Date of Joining';                                
0055.70             iter;                                                             
0055.71           When not (DCOUNTRY >= 'A' and DCOUNTRY <= 'Z');                     
0055.72             *in31 = *on;                                                      
0055.73             ERRMSG1 = 'Only alphabets allowed in country field';              
0055.74             iter;                                                             
0055.75           When %check(digits: %char(DPIN)) <> %len(%trimr(%char(DPIN)))+1;    
0055.76             *in32 = *on;                                                      
0055.77             ERRMSG1 = 'Only digits accepted in Pincode';                      
0055.78             iter;                                                             
0055.79           When not (%len(%trimr(%char(DPIN))) = 6);                           
0055.80             *in32 = *on;                                                      
0055.81             ERRMSG1 = 'Pin should be of 6 digits';                            
0055.82             iter;                                                             
0055.83           When DDSG >= '1' and DDSG <= '9';                                   
0055.84             *in34 = *on;                                                      
0055.85             ERRMSG1 = 'Designation should contain only alphabets';            
0055.86             iter;                                                             
0055.87           When DNUM = 0;                                                      
0055.88             *in36 = *on;                                                      
0055.89             ERRMSG1 = 'Mobile Number is mandatory';                           
0055.90             iter;                                                             
0055.91           When %check(digits: %char(DNUM)) <> %len(%trimr(%char(DNUM)))+1;    
0055.92             *in36 = *on;                                                      
0055.93             ERRMSG1 = 'Mobile number should be digits only';                  
0055.94             iter;                                                             
0055.95           When %subst(%char(DNUM):1:1) = '0';                                 
0055.96             *in36 = *on;                                                      
0055.97             ERRMSG1 = 'Mobile number cannot start with zero';                 
0055.98             iter;                                                             
0055.99           When %len(%trimr(%char(DENUM))) <= 9;                               
0056.00             *in38 = *on;                                                      
0056.01             ERRMSG1 = 'Mobile number should be of 10 digits';                 
0056.02             iter;                                                             
0056.03           When DENUM = 0;                                                     
0056.04             *in38 = *on;                                                  
0056.05             ERRMSG1 = 'Mobile Number is mandatory';                       
0056.06             iter;                                                         
0056.07           When (%char(DENUM) >= 'A' and %char(DENUM) <= 'Z');             
0056.08             *in38 = *on;                                                  
0056.09             ERRMSG1 = 'Mobile number should be digits only';              
0056.10             iter;                                                         
0056.11           When %subst(%char(DENUM):1:1) = '0';                            
0056.12             *in38 = *on;                                                  
0056.13             ERRMSG1 = 'Mobile number cannot start with zero';             
0056.14             iter;                                                         
0056.15           When %len(%trimr(%char(DNUM))) <= 9;                            
0056.16             *in34 = *on;                                                  
0056.17             ERRMSG1 = 'Mobile number should be of 10 digits';             
0056.18             iter;                                                         
0056.19           When %scan('@': DEMAILP) = 0 or %scan('.':DEMAILP) = 0;         
0056.20             *in40 = *on;                                                  
0056.21             ERRMSG1 = 'Email must contain @ and .';                       
0056.22             iter;                                                         
0056.23           When %scan('@': DEMAILO) = 0 or %scan('.':DEMAILO) = 0;         
0056.24             *in39 = *on;                                       
0056.25             ERRMSG1 = 'Email must contain @ and .';            
0056.26             iter;                                              
0056.27           Other;                                               
0056.28             ID = DID;                                          
0056.29             NAME = DNAME;                                      
0056.30             GEN = DGEN;                                        
0056.31             CITY = DCITY;                                      
0056.32             DOB = DDOB;                                        
0056.33             ExSr $DateCheckSr;                                 
0056.34             If (Flag = *off and ERRMSG1 = *blanks);            
0056.35             DOJ = DDOJ;                                        
0056.36             ExSr $DateCheckSr1;                                
0056.37             ADD = DADD;                                        
0056.38             COUNTRY = DCOUNTRY;                                
0056.39             PIN = DPIN;                                        
0056.40             TEAM = DTEAM;                                      
0056.41             PID = DPID;                                        
0056.42             MID = DMID;                                        
0056.43             DSG = DDSG;                                        
0056.44             NUM = DNUM;                                                
0056.45             ENUM = DENUM;                                              
0056.46             EMAILO = DEMAILO;                                          
0056.47             EMAILP = DEMAILP;                                          
0056.48             STATUS = DSTATUS;                                          
0056.49             ROLE = DROLE;                                              
0056.50             EndIf;                                                     
0056.51             If Flag = *off and Flag2 = *off and ERRMSG1 = *blanks;     
0056.52               ERRMSG1 = 'RECORD ADDED SUCCESSFULLY!';                  
0056.53               Write EMPMASTERR;                                        
0056.54               ExSr $EmpDetailSr;                                       
0056.55               ExSr $ClearSr;                                           
0056.56               ExSr $LoadSr;                                            
0056.57             EndIf;                                                     
0056.58          EndSl;                                                        
0056.59          enddo;                                                        
0056.60          *in03 = *off;                                                 
0057.00        EndSr;                                                          
0058.00                                                                        
0059.00        Begsr $EdtSr;                                                   
0059.01            Clear ERRMSG2;              
0059.02            Chain ID EMPMASTER;         
0059.03            If %found();                
0059.04   //       DID = ID;                   
0059.05  //        DNAME = NAME;               
0059.06   //       DGEN = GEN;                 
0059.07    //      DDOB = DOB;                 
0059.08            DCITY = CITY;               
0059.09            DADD = ADD;                 
0059.10            DCOUNTRY = COUNTRY;         
0059.11            DPIN = PIN;                 
0059.12            DTEAM = TEAM;               
0059.13            DMID = MID;                 
0059.14            DPID = PID;                 
0059.15            DEMAILO = EMAILO;           
0059.16            DEMAILP = EMAILP;           
0059.17            DROLE = ROLE;               
0059.18            DSTATUS = STATUS;           
0059.19            DNUM = NUM;                 
0059.20            DENUM = ENUM;               
0059.21            DDSG = DSG;                                    
0059.22            endif;                                         
0060.00          Dow *in03 = *off;                                
0061.00            ExFmt EDTRCD;                                  
0061.01            Select;                                        
0061.02            When *in12 = *on;                              
0061.03              *in12 = *off;                                
0061.04              LeaveSr;                                     
0061.05            When *in05 = *on;                              
0061.06              *in05 = *off;                                
0061.07              ExSr $EmpDetailSr;                           
0061.08            When *in04 = *on and csrfld = 'DTEAM';         
0061.09              *in04 = *off;                                
0061.10              ExFmt TEAMWIN;                               
0061.11              If SELT = 1;                                 
0061.12                DTEAM = 'RPG';                             
0061.13                DPID = 'RPG123';                           
0061.14                DMID = 106;                                
0061.15              ElseIf SELT = 2;                             
0061.16                DTEAM = 'JAVA';                            
0061.17                DPID = 'JAVA123';                      
0061.18                DMID = 107;                            
0061.19              ElseIf SELT = 3;                         
0061.20                DTEAM = 'PYTHON';                      
0061.21                DPID = 'PTH1';                         
0061.22                DMID = 108;                            
0061.23              ElseIf SELT = 4;                         
0061.24                DTEAM = 'C++';                         
0061.25                DPID = 'CPP1';                         
0061.26                DMID = 109;                            
0061.27              ElseIf SELT = 5;                         
0061.28                DTEAM = 'ML';                          
0061.29                DPID = 'ML1';                          
0061.30                DMID = 110;                            
0061.31              Else;                                    
0061.32                DTEAM = 'RUBY';                        
0061.33                DPID = 'RUBY1';                        
0061.34                DMID = 111;                            
0061.35              EndIf;                                   
0061.36              iter;                                    
0061.37            When *in04 = *on and csrfld = 'STATUS';      
0061.38              *in04 = *off;                              
0061.39              ExFmt STATUSWIN;                           
0061.40              If SELS = 1;                               
0061.41                DSTATUS = 'A';                           
0061.42              Else;                                      
0061.43                DSTATUS = 'I';                           
0061.44              EndIf;                                     
0061.45              iter;                                      
0061.46            When *in04 = *on and csrfld = 'ROLE';        
0061.47              *in04 = *off;                              
0061.48              ExFmt ROLEWIN;                             
0061.49              If SELR = 1;                               
0061.50                DROLE = 'A';                             
0061.51              ElseIf SELR = 2;                           
0061.52                DROLE = 'M';                             
0061.53              Else;                                      
0061.54                DROLE = 'E';                             
0061.55              EndIf;                                     
0061.56              iter;                                      
0061.57           When not (%CHAR(PIN) >= '0' and %CHAR(PIN) <= '9');                 
0061.58           //  Clear MSG1;                                                     
0061.59             *in33 = *on;                                                      
0061.60             ERRMSG2 = 'Only digits accepted in Pincode';                      
0061.61             iter;                                                             
0061.62           When not (%len(%trimr(%char(PIN))) = 6);                            
0061.63         //  Clear MSG1;                                                       
0061.64             *in33 = *on;                                                      
0061.65             ERRMSG2 = 'Pin should be of 6 digits';                            
0061.66             iter;                                                             
0061.67           When NUM = 0;                                                       
0061.68             *in34 = *on;                                                      
0061.69             ERRMSG2 = 'Mobile no. cannot be blanks';                          
0061.70             iter;                                                             
0061.71           When (%char(NUM) >= 'A' and %char(NUM) <= 'Z');                     
0061.72             *in34 = *on;                                                      
0061.73             ERRMSG2 = 'Mobile number should be digits only';                  
0061.74             iter;                                                             
0061.75           When %subst(%char(NUM):1:1) = '0';                                  
0061.76             *in34 = *on;                                                      
0061.77            ERRMSG2 = 'Mobile number cannot start with zero';   
0061.78             iter;                                              
0061.79           When %len(%trimr(%char(NUM))) <= 9;                  
0061.80             *in34 = *on;                                       
0061.81             ERRMSG2 = 'Mobile number should be of 10 digits';  
0061.82             iter;                                              
0061.83           Other;                                               
0061.84             Chain ID EMPMASTERR;                               
0061.85               If %found;                                       
0061.86                 CITY = DCITY;                                  
0061.87                 ADD = DADD;                                    
0061.88                 COUNTRY = DCOUNTRY;                            
0061.89                 PIN = DPIN;                                    
0061.90                 TEAM = DTEAM;                                  
0061.91                 PID = DPID;                                    
0061.92                 MID = DMID;                                    
0061.93                 DSG = DDSG;                                    
0061.94                 NUM = DNUM;                                    
0061.95                 ENUM = DENUM;                                  
0061.96                 EMAILO = DEMAILO;                              
0061.97                 EMAILP = DEMAILP;                         
0061.98                 STATUS = DSTATUS;                         
0061.99                 ROLE = DROLE;                             
0062.00                 Update EMPMASTERR;                        
0062.01                 ERRMSG2 = 'UPDATED SUCCESSFULLY!';        
0062.02               EndIf;                                      
0062.03            EndSl;                                         
0062.05          endDo;                                           
0062.06          *in03 = *off;                                    
0063.00        EndSr;                                             
0064.00                                                           
0065.00        BegSr $ViewSr;                                     
0065.01          Dow *in03 = *off;                                
0065.02            Chain ID EMPMASTER;                            
0066.00            ExFmt VIEWRCD;                                 
0067.00          endDo;                                           
0068.00          *in03 = *off;                                    
0069.00        EndSr;                                             
0070.00                                                           
0071.00        BegSr $AddHldSr;                                   
0071.01          ExSr $CheckSr;                           
0072.00          DoW *in03 = *off;                        
0072.02            ExFmt ADDHLD;                          
0072.03            ExSr $CheckSr;                         
0072.08            Select;                                
0072.10            When *in05 = *on;                      
0072.11              *in05 = *off;                        
0072.12              Clear ADDHLD;                        
0072.13            When *in12 = *on;                      
0072.14              *in12 = *off;                        
0072.15              LeaveSr;                             
0072.16            When DDATE = 0;                        
0072.17              *in13 = *on;                         
0072.18              ERRMSG4 = 'Enter date';              
0072.19              iter;                                
0072.33            When *in04 = *on and csrfld = 'DDAY';  
0072.34              *in04 = *off;                        
0072.35              ExFmt HLDWIN;                        
0072.36              If SELH = 1;                         
0072.37                DDAY = 'MONDAY';                   
0072.38              ElseIf SELH = 2;                                  
0072.39                DDAY = 'TUESDAY';                               
0072.40              ElseIf SELH = 3;                                  
0072.41                DDAY = 'WEDNESDAY';                             
0072.42              ElseIf SELH = 4;                                  
0072.43                DDAY = 'THURSDAY';                              
0072.44              ElseIf SELH = 5;                                  
0072.50                DDAY = 'FRIDAY';                                
0072.51              ElseIf SELH = 6;                                  
0072.52                DDAY = 'SATURDAY';                              
0072.53              Else;                                             
0072.54                DDAY = 'SUNDAY';                                
0072.55              EndIf;                                            
0072.56              iter;                                             
0072.57            When DREMARK = *blanks;                             
0072.58              *in15 = *on;                                      
0072.59              ERRMSG4 = 'Remarks is mandatory';                 
0072.60              iter;                                             
0072.61            When DDAY = *blanks;                                
0072.62              *in14 = *on; 
0072.63              ERRMSG4 = 'Day is mandatory';               
0072.64              iter;                                       
0072.65            Other;                                        
0072.66              DATE = DDATE;                               
0072.67              ExSr $DateCheckSr;                          
0072.68              DAY = DDAY;                                 
0072.69              REMARKS = DREMARK;                          
0072.70              If Flag = *off and ERRMSG4 = *blanks;       
0072.71                Write HOLIDAYPFR;                         
0072.72                Clear ADDHLD;                             
0072.73                ERRMSG4 = 'HOLIDAY ADDED SUCCESSFULLY';   
0072.74              EndIf;                                      
0072.77            EndSl;                                        
0073.00          EndDo;                                          
0073.01          *in03 = *off;                                   
0074.00        EndSr;                                            
0075.00                                                          
0076.00        BegSr $ViewHldSr;                                 
0076.01          Clear HLDCTL;                                   
0079.00          ExSr $ClearViewHldSr;                           
0080.00          ExSr $LoadViewHldSr;                        
0081.00          Write FOOTER;                               
0081.01          Clear ERRMSG5;                              
0082.00          DoW *in03 = *off;                           
0083.00            ExFmt HLDCTL;                             
0083.01            ReadC HLDDATA;                            
0083.02            Select;                                   
0083.03            When *in05 = *on;                         
0083.04              *in05 = *off;                           
0083.05              Clear DOPT;                             
0083.06              Clear ERRMSG5;                          
0083.07            When *in12 = *on;                         
0083.08              *in12 = *off;                           
0083.09              LeaveSr;                                
0083.10            When DOPT = 2;                            
0083.11              DOPT = 0;                               
0083.12              ExSr $UPDHLD;                           
0083.13              ERRMSG5 = 'Updated Successfully';       
0083.14              ExSr $ClearViewHldSr;                   
0083.15              ExSr $LoadViewHldSr;                    
0083.16              iter;                                          
0083.17            When DOPT = 4;                                   
0083.18              DOPT = 0;                                      
0083.19              Exsr $DelHldSr;                                
0083.20              ExSr $ClearViewHldSr;                          
0083.21              ExSr $LoadViewHldSr;                           
0083.22              ERRMSG5 = 'Deleted Successfully';              
0083.23              iter;                                          
0083.24            When DOPT <> 0 and (DOPT <> 2 or DOPT <> 4);     
0083.25              ERRMSG5 = 'Invalid Option';                    
0083.26              iter;                                          
0083.27            Other;                                           
0083.28              ERRMSG5 = 'Wrong Function key pressed';        
0083.29    //        iter;                                          
0083.30            EndSl;                                           
0084.00          enddo;                                             
0084.01          DOPT = 0;                                          
0084.02          Clear ERRMSG5;                                     
0085.00          *in03 = *off;                                      
0085.01        EndSr;                                               
0085.02                                     
0086.00        BegSr $ClearViewHldSr;       
0087.00          *in52 = *off;              
0087.01          USER = 'Admin';            
0088.00          Write HLDCTL;              
0089.00          *in52 = *on;               
0090.00          RRN2 = 0;                  
0091.00        EndSr;                       
0092.00                                                               
0093.00        BegSr $LoadViewHldSr;                                  
0094.00          Setll *start HOLIDAYPF;                              
0095.00          Read HOLIDAYPF;                                      
0096.00          Dow not %eof(HOLIDAYPF);                             
0097.00            RRN2 = RRN2 + 1;                                   
0098.00            Write HLDDATA;                                     
0099.00            Read HOLIDAYPF;                                    
0100.00          Enddo;                                               
0100.01          Write FOOTER;                                        
0101.00        EndSr;                                                 
0102.00                                                               
0102.01        BegSr $DelSr;                                          
0102.02          Clear ADMOPT;                                        
0102.03          Dow *in03 = *off;                                    
0102.05            ExSr $ClearDelSr;                                  
0102.06            ExSr $LoadDelSr;                                   
0102.07            HEADING = 'Confirm Delete of Records';             
0102.08            USER = 'ADMIN';                                    
0102.09            Write HEADER;                                      
0102.10            Write FOOTER;                               
0102.13            ExFmt DELCTL;                               
0102.16            Select;                                     
0102.17            When *in12 = *on;                           
0102.18              *in12 = *off;                             
0102.19              LeaveSr;                                  
0102.20            EndSl;                                      
0102.21          EndDo;                                        
0102.22          *in03 = *off;                                 
0102.23          ExSr $ClearSr;                                
0102.24          ExSr $LoadSr;                                 
0102.25        EndSr;                                          
0102.26                                                        
0102.27        BegSr $ClearDelSr;                              
0102.28          *in51 = *off;                                 
0102.29          Write DELCTL;                                 
0102.30          *in51 = *on;                                  
0102.31          RRN3 = 0;                                     
0102.32        EndSr;                                          
0102.33                                                        
0102.34        BegSr $LoadDelSr;              
0102.35          Chain ID EMPMASTER;          
0102.36          If %found(empmaster);        
0102.37            RRN3 = RRN3 + 1;           
0102.38            Write DELSFLDATA;          
0102.40          EndIf;                       
0102.41        EndSr;                         
0102.42                                       
0103.00        BegSr $UPDHLD;                 
0103.01          Clear UPDHLD;                
0103.02          Clear ERRMSG5;               
0103.03          ExSr $CheckSr;               
0103.04          Chain DATE HOLIDAYPF;        
0103.05          If %found(HOLIDAYPF);        
0103.06            DDATE = DATE;              
0103.07            DDAY = DAY;                
0103.08            DREMARK = REMARKS;         
0103.09          EndIf;                       
0104.00          Dow *in03 = *off;            
0104.01            Write FOOTER;              
0105.00            ExFmt UPDHLD;                            
0105.01            ExSr $CheckSr;                           
0106.00            Select;                                  
0107.00            When *in05 = *on;                        
0107.01              *in05 = *off;                          
0108.00              Clear UPDHLD;                          
0109.00            When *in12 = *on;                        
0110.00              *in12 = *off;                          
0111.00              LeaveSr;                               
0111.01            When DDATE = 0;                          
0111.03              *in13 = *on;                           
0111.04              UPDHLDMSG = 'Cannot be blanks';        
0111.06              iter;                                  
0111.07            When *in04 = *on and csrfld = 'DDAY';    
0111.08              *in04 = *off;                          
0111.09              ExFmt HLDWIN;                          
0111.10              If SELH = 1;                           
0111.11                DDAY = 'MONDAY';                     
0111.12              ElseIf SELH = 2;                       
0111.13                DDAY = 'TUESDAY';                    
0111.14              ElseIf SELH = 3;                            
0111.15                DDAY = 'WEDNESDAY';                       
0111.16              ElseIf SELH = 4;                            
0111.17                DDAY = 'THURSDAY';                        
0111.18              ElseIf SELH = 5;                            
0111.19                DDAY = 'FRIDAY';                          
0111.20              ElseIf SELH = 6;                            
0111.21                DDAY = 'SATURDAY';                        
0111.22              Else;                                       
0111.23                DDAY = 'SUNDAY';                          
0111.24              EndIf;                                      
0111.25              iter;                                       
0111.26            When DREMARK = *blanks;                       
0111.27              *in15 = *on;                                
0111.28              UPDHLDMSG = 'Remarks is mandatory';         
0111.29              iter;                                       
0111.30            When DDAY = *blanks;                          
0111.31              *in14 = *on;                                
0111.32              UPDHLDMSG = 'Day is mandatory';             
0111.33              iter;                                       
0111.34            Other;                                      
0111.37              Chain DDATE HOLIDAYPF;                    
0111.38              If %found;                                
0111.41                If Flag = *off and UPDHLDMSG = *blanks; 
0111.42                  DAY = DDAY;                           
0111.43                  REMARKS = DREMARK;                    
0111.44                  Update HOLIDAYPFR;                    
0111.45                  Clear UPDHLD;                         
0111.46                  *in03 = *on;                          
0111.48                EndIf;                                  
0111.49              EndIf;                                    
0112.00            EndSl;                                      
0113.00          EndDo;                                        
0113.01          *in03 = *off;                                 
0113.02     //   ERRMSG5 = 'Updated';                          
0114.00        EndSr;                                          
0114.01                                                        
0114.02       BegSr $DelHldSr;                                 
0114.03           HEADING = 'Delete Holidays';                 
0114.04           Write HEADER;                                
0114.05           ExFmt DELHLD;                
0114.06           If *in12 = *on;              
0114.07             *in12 = *off;              
0114.08             LeaveSr;                   
0114.09           EndIf;                       
0114.10           Chain DATE HOLIDAYPF;        
0114.11           If %found;                   
0114.12             DELETE HOLIDAYPFR;         
0114.13             LeaveSr;                   
0114.14           EndIf;                       
0114.15       EndSr;                           
0114.16                                        
0114.17       BegSr $ApplyCompsr;              
0114.18         ExSr $CheckSr;                 
0114.19         DoW *in03 = *off;              
0114.20           HEADING = 'Apply Leaves';    
0114.21           Write HEADER;                
0114.22           Write FOOTER;                
0114.28           ExFmt APPLYCOMP;             
0114.29           Exsr $CheckSr;               
0114.30           Select;                                  
0114.31           When *in12 = *on;                        
0114.32             *in12 = *off;                          
0114.33             LeaveSr;                               
0114.34           When *in05 = *on;                        
0114.35             *in05 = *off;                          
0114.36             Clear APPLYCOMP;                       
0114.37           When *in04 = *on and csrfld = 'DDAYTYPE';
0114.38             *in04 = *off;                          
0114.39             ExFmt DAYTYPEWIN;                      
0114.40             If SELDT = 1;                          
0114.41               DDAYTYPE = 'FH';                     
0114.42             ElseIf SELDT = 21;                     
0114.43               DDAYTYPE = 'SH';                     
0114.44             Else;                                  
0114.45               DDAYTYPE = 'FD';                     
0114.46             EndIf;                                 
0114.47             iter;                                  
0114.48           When DCOMPDATE = 0;                      
0114.49             *in91 = *on;                           
0114.50             ERRCOMP = 'Enter date';                       
0114.51             iter;                                         
0114.65           When DREASON = *blanks;                         
0114.66             *in93 = *on;                                  
0114.67             ERRCOMP = 'Reason is mandatory';              
0114.68             iter;                                         
0114.69           When DPID = *blanks;                            
0114.70             *in94 = *on;                                  
0114.71             ERRCOMP = 'Project ID is mandatory';          
0114.72             iter;                                         
0114.73           Other;                                          
0114.74             Clear ERRCOMP;                                
0114.75             Chain DUSERM EMPMASTER;                       
0114.76             If %found;                                    
0114.77               COMPID = ID;                                
0114.78               STATUS = 'P';                               
0114.79               COMPDATE = DCOMPDATE;                       
0114.80               ExSr $DateCheckSr;                          
0114.81               COMPDAY = DDAYTYPE;                         
0114.82               REASON = DREASON;                           
0114.83               PROJECTID = DPID;                          
0114.84              If Flag = *off and ERRCOMP = *blanks;       
0114.85                Write COMPOFFPFR;                         
0114.86                Clear APPLYCOMP;                          
0114.87             ERRCOMP = 'COMP OFF APPLIED SUCCESSFULLY';   
0114.88             // ERRMSG4 = 'HOLIDAY ADDED SUCCESSFULLY';   
0114.89              EndIf;                                      
0114.90             Endif;                                       
0114.91       //    WRITE COMPOFFPFR;                            
0114.92      //     Clear APPLYCOMP;                             
0114.93           endSl;                                         
0114.94         EndDo;                               
0114.95         *in03 = *off;                        
0114.96         Clear SELE;                          
0114.97       EndSr;                                 
0114.98                                              
0114.99       BegSr $ApplyLeave1Sr;                  
0115.00         Clear APPLEAVE1;                     
0115.01         DoW *in03 = *off;                    
0115.02           Clear SELE;                        
0115.03           HEADING = 'Apply Leaves';          
0115.04           Write HEADER;                      
0115.05           Write FOOTER;                      
0115.06           Chain DUSERM LEAVEBALPF;           
0115.07           If %found;                         
0115.08             DCL = CL;                        
0115.09             DEL = EL;                        
0115.10             DCOL = COL;                      
0115.11           EndIf;                             
0115.12           ExFmt APPLEAVE1;                   
0115.13           date_num = %dec(%date());          
0115.14           Chain date_num HOLIDAYPF;                                                   
0115.15           If %found();                                                                
0115.16             APPLVMSG1 = 'You cannot apply leave on holiday';                          
0115.17           Else;                                                                       
0115.18             If DCL + DEL + DCOL = 0;                                                  
0115.19               APPLVMSG1 = 'Your leave balance is zero cannot apply';                  
0115.20             Else;                                                                     
0115.21               Clear APPLVMSG2;                                                        
0115.23               Select;                                                                 
0115.24               When SELLEAVE = '1';                                                    
0115.25                 Clear SELLEAVE;                                                       
0115.26                 If DCL = 0;                                                           
0115.27                   APPLVMSG1 = 'Cannot apply CL';                                      
0115.28                 Else;                                                                 
0115.29                   TempLeaveType = 'CL';                                               
0115.30                   ExSr $ApplyLeave2Sr;                                                
0115.31                 EndIf;                                                                
0115.32                 iter;                                                                 
0115.33              When SELLEAVE = '2';                                                     
0115.34                Clear SELLEAVE;                                                        
0115.35                 If DEL = 0;                             
0115.36                   APPLVMSG1 = 'Cannot apply EL';        
0115.37                 Else;                                   
0115.38                   TempLeaveType = 'EL';                 
0115.39                   ExSr $ApplyLeave2Sr;                  
0115.40                 EndIf;                                  
0115.41                iter;                                    
0115.42              When SELLEAVE = '3';                       
0115.43                Clear SELLEAVE;                          
0115.44            //  Clear                                    
0115.45                 If DCOL = 0;                            
0115.46                   APPLVMSG1 = 'Cannot apply CO';        
0115.47                 Else;                                   
0115.48                   TempLeaveType = 'CO';                 
0115.49                   ExSr $ApplyLeave2Sr;                  
0115.50                 EndIf;                                  
0115.51                iter;                                    
0115.52              Other;                                     
0115.53                APPLVMSG1 = 'Wrong Option pressed';                  
0115.54              EndSl;                                                 
0115.55            EndIf;                                                   
0115.56          EndIf;                                                     
0115.57         EndDo;                                                      
0115.58         *in03 = *off;                                               
0115.59         Clear APPLEAVE1;                                            
0115.60       EndSr;                                                        
0115.61                                                                     
0115.62       BegSr $ApplyLeave2Sr;                                         
0115.63         Clear APPLEAVE2;                                            
0115.64         DoW *in03 = *off;                                           
0115.65           HEADING = 'Apply Leaves';                                 
0115.66           Write HEADER;                                             
0115.67           Write FOOTER2;                                            
0115.68           ExFmt APPLEAVE2;                                          
0115.69           ExSr $CheckSr;                                            
0115.70           Select;                                                   
0115.71           When *in12 = *on;                                         
0115.72             *in12 = *off;                                           
0115.73             LeaveSr;                                              
0115.74           When *in05 = *on;                                       
0115.75             *in05 = *off;                                         
0115.76             Clear APPLEAVE2;                                      
0115.77           When *in04 = *on and csrfld = 'DFDAY';                  
0115.78             *in04 = *off;                                         
0115.79             Clear DFDAY;                                          
0115.80             ExFmt DAYTYPEWIN;                                     
0115.81             If SELDT = 1;                                         
0115.82               DFDAY = 'FH';                                       
0115.83             ElseIf SELDT = 2;                                     
0115.84               DFDAY = 'SH';                                       
0115.85             Else;                                                 
0115.86               DFDAY = 'FD';                                       
0115.87             EndIf;                                                
0115.88             iter;                                                 
0115.89           When *in04 = *on and csrfld = 'DTDAY';                  
0115.90             *in04 = *off;                                         
0115.91             Clear DTDAY;                                          
0115.92             ExFmt DAYTYPEWIN;                                     
0115.93             If SELDT = 1;           
0115.94               DTDAY = 'FH';         
0115.95             ElseIf SELDT = 21;      
0115.96               DTDAY = 'SH';         
0115.97             Else;                   
0115.98               DTDAY = 'FD';         
0115.99             EndIf;                            
0116.00             iter;                             
0116.01           When DFDATE = 0;                    
0116.02             *in61 = *on;                      
0116.03             APPLVMSG2 = 'Mandatory Entry';    
0116.04             iter;                             
0116.05           When DTDATE = 0;                    
0116.06             *in62 = *on;                      
0116.07             APPLVMSG2 = 'Mandatory Entry';    
0116.08             iter;                             
0116.17           When DREASON = *blanks;             
0116.18             *in65 = *on;                      
0116.19             APPLVMSG2 = 'Mandatory Entry';    
0116.20             iter;                             
0116.21           When DFDAY = *blanks;               
0116.22             *in63 = *on;                      
0116.23             APPLVMSG2 = 'MAndatory Entry';    
0116.24             iter;                             
0116.25           When DTDAY = *blanks;               
0116.26             *in64 = *on;                      
0116.27             APPLVMSG2 = 'MAndatory Entry';                                
0116.28             iter;                                                         
0116.29           Other;                                                          
0116.30             ID = DUSERM;                                                  
0116.31             FDATE = DFDATE;                                               
0116.32             ExSr $DateCheckSr;                                            
0116.33             If Flag = *off and APPLVMSG2 = *blanks;                       
0116.34             TDATE = DTDATE;                                               
0116.35             ExSr $DateCheckSr1;                                           
0116.36             FDAY = DFDAY;                                                 
0116.37             TDAY = DTDAY;                                                 
0116.38             STATUS = 'P';                                                 
0116.39             REASON = DREASON;                                             
0116.40             TOTAL = days_num + 1;                                         
0116.41             TYPE = TempLeaveType;                                         
0116.42             If Flag = *off and Flag2 = *off and APPLVMSG2 = *blanks;      
0116.43               Write LEAVESR;                                              
0116.44               DTDATE = 0;                                                 
0116.45               DFDATE = 0;                                                 
0116.46               DFDAY = *blanks;                                            
0116.47               DTDAY = *blanks;                                              
0116.48               DREASON = *blanks;                                            
0116.49               APPLVMSG2 = 'LEAVE APPLIED SUCCESSFULLY';                     
0116.50               Chain DUSERM LEAVEBALPF;                                      
0116.51               If %found(LEAVEBALPF);                                        
0116.52                 If TYPE = 'CL';                                             
0116.53                   DCL = DCL - 1;                                            
0116.54                   CL = DCL;                                                 
0116.55                   Update LEAVEBPFR;                                         
0116.56                 Elseif TYPE = 'EL';                                         
0116.57                   DEL = DEL - 1;                                            
0116.58                   EL = DEL;                                                 
0116.59                   Update LEAVEBPFR;                                         
0116.60                 Elseif TYPE = 'CO';                                         
0116.61                   DCOL = DCOL - 1;                                          
0116.62                   COL = DCOL;                                               
0116.63                   Update LEAVEBPFR;                                         
0116.64                 EndIf;                                                      
0116.65               EndIf;                                                        
0116.66             EndIf;                                                          
0116.67             Endif;                   
0116.68           EndSl;                     
0116.69         EndDo;                       
0116.70         *in03 = *off;                
0116.71       EndSr;                         
0116.72                                      
0116.73                                      
0116.74       BegSr $LeaveStatusSr;          
0116.75         ExSr $ClearLeaveSr;          
0116.76         ExSr $LoadLeaveSr;           
0116.77         DoW *in03 = *off;            
0116.78         Write HEADER;                
0116.79         Write SFLFOOTER;             
0116.80           ExFmt LEAVECTL;                      
0116.81           ReadC LEAVEDATA;                     
0116.82           Select;                              
0116.83           When *in05 = *on;                    
0116.84             *in05 = *off;                      
0116.85             Clear OPT;                         
0116.86             Clear MSGFOOT;                     
0116.87           When *in12 = *on;                    
0116.88             *in12 = *off;                      
0116.89             LeaveSr;                           
0116.90           When OPT = 1;                        
0116.91             OPT = 0;                           
0116.92             STATUS = 'C';                      
0116.93       //    Setll FDATE LEAVESPF;              
0116.94       //    ReadE FDATE LEAVESPF;              
0116.95        //   If %found(LEAVESPF);               
0116.96        //     STATUS = 'C';                    
0116.97     //        Update LeaveSr;                  
0116.98     //        ExSr $ClearLeaveSr;              
0116.99       //      ExSr $LoadLeaveSr;               
0117.00      //       ReadE FDATE LEAVESPF;             
0117.01      //     EndIf;                              
0117.02           EndSl;                                
0117.03         EndDo;                                  
0117.04         *in03 = *off;                           
0117.05       EndSr;                                    
0117.06                                                 
0117.07        BegSr $ClearLeaveSr;                     
0117.08          *in53 = *off;                          
0117.09          Write LEAVECTL;                        
0117.10          *in53 = *on;                           
0117.11          RRN4 = 0;                              
0117.12        EndSr;                                   
0117.13                                                 
0117.14        BegSr $LoadLeaveSr;                      
0117.15          Setll DUSERM LEAVESPF;                 
0117.16          ReadE DUSERM LEAVESPF;                 
0117.17          Dow not %eof(LEAVESPF);                
0117.18            RRN4 = RRN4 + 1;                     
0117.19            Write LEAVEDATA;                     
0117.20            Reade DUSERM LEAVESPF;           
0117.21          Enddo;                             
0117.22          Clear MSGFOOT;                     
0117.23        EndSr;                               
0117.24                                             
0117.25       BegSr $CompStatusSr;                  
0117.26          ExSr $ClearCompSr;                 
0117.27          ExSr $LoadCompSr;                  
0117.28      //  Write HEADER;                      
0117.29          Write FOOTER;                      
0117.30         Dow *in03 = *off;                   
0117.31           ExFmt COMPCTL;                    
0117.32           ReadC COMPDATA;                   
0117.33           If OPT = 1 and STATUS = 'P';      
0117.34             OPT = 0;                        
0117.35             Chain ID COMPOFFPF;             
0117.36             If %found();                    
0117.37               STATUS = 'C';                 
0117.38               Update COMPOFFPFR;                
0117.39               ExSr $ClearCompSr;                
0117.40               Exsr $LoadCompsr;                 
0117.41             EndIf;                              
0117.42           ElseIf OPT <> 0 and OPT <> 1;         
0117.43             ERRMSG5 = 'Wrong Option pressed';   
0117.44           Else;                                 
0117.45             ERRMSG5 = 'Invalid Function key';   
0117.46           EndIf;                                
0117.47         EndDo;                                  
0117.48         *in03 = *off;                           
0117.49       EndSr;                                    
0117.50                                                 
0117.51        BegSr $ClearCompSr;                      
0117.52          *in54 = *off;                          
0117.53          Write COMPCTL;                         
0117.54          *in54 = *on;                           
0117.55          RRN5 = 0;                              
0117.56        EndSr;                                   
0117.57                                                 
0117.58        BegSr $LoadCompSr;             
0117.59          Setll DUSERM COMPOFFPF;      
0117.60          ReadE DUSERM COMPOFFPF;      
0117.61          Dow not %eof(COMPOFFPF);     
0117.62            RRN5 = RRN5 + 1;           
0117.63            Write COMPDATA;            
0117.64            Reade DUSERM COMPOFFPF;    
0117.65          Enddo;                       
0117.66          Clear MSGFOOT;               
0117.67        EndSr;                         
0117.68                                       
0117.69        BegSr $ViewHolidaySr;          
0117.70          ExSr $ClearViewHSr;          
0117.71          ExSr $LoadViewHSr;           
0117.72     //   Write HEADER;                
0117.73          Write FOOTER;                
0117.74          Dow *in03 = *off;            
0117.75            ExFmt VIEWHCTL;            
0117.76            Select;                    
0117.77            When *in05 = *on;          
0117.78              *in05 = *off;              
0117.79          //  ExSr $ClearViewHSr;        
0117.80          //  ExSr $LoadViewHSr;         
0117.81         //   Write FOOTER;              
0117.82            When *in12 = *on;            
0117.83              *in12 = *off;              
0117.84              LeaveSr;                   
0117.85            EndSl;                       
0117.86          EndDo;                         
0117.87          *in03 = *off;                  
0117.88        EndSr;                           
0117.89                                         
0117.90        BegSr $ClearViewHSr;             
0117.91          *in58 = *off;                  
0117.92          Write VIEWHCTL;                
0117.93          *in58 = *on;                   
0117.94          RRN9 = 0;                   
0117.95        EndSr;                        
0117.96                                      
0117.97        BegSr $LoadViewHSr;           
0117.98          Setll *loval HOLIDAYPF;     
0117.99          Read HOLIDAYPF;             
0118.00          Dow not %eof(HOLIDAYPF);    
0118.01            RRN9 = RRN9 + 1;          
0118.02            Write VIEWHDATA;          
0118.03            Read HOLIDAYPF;           
0118.04          Enddo;                      
0118.05          Clear MSGFOOT;              
0118.06        EndSr;                        
0118.07       BegSr $UpdPwdSr;               
0118.08         ExSr $CheckSr;               
0118.09         Clear UPWD;                  
0118.10         DID = DUSERM;                
0118.11         Dow *in03 = *off;            
0118.14           ExFmt UPWD;                                        
0118.15           ExSr $CheckSr;                                     
0118.16           Chain DUSERM LOGINPF;                              
0118.17           If %found();                                       
0118.18             TempPwd = PWD;                                   
0118.19             Select;                                          
0118.20           When *in05 = *on;                                  
0118.21             *in05 = *off;                                    
0118.22             Clear UPWD;                                      
0118.23           When *in12 = *on;                                  
0118.24             *in12 = *off;                                    
0118.25             LeaveSr;                                         
0118.26             When DCURPWD = *blanks;                          
0118.27               UPWDMSG = 'Enter current password';            
0118.28               *in97 = *on;                                   
0118.29               iter;                                          
0118.30             When not (DCURPWD = TempPwd);                    
0118.31               UPWDMSG = 'Current Password not correct';      
0118.32               *in97 = *on;                                   
0118.33               iter;                                          
0118.34             When DNEWPWD = *blanks;                                        
0118.35               *in98 = *on;                                                 
0118.36               UPWDMSG = 'Enter new password';                              
0118.37             When DCURPWD = DNEWPWD;                                        
0118.38               *in98 = *on;                                                 
0118.39               UPWDMSG = 'New Password cannot be same as Current password'; 
0118.40               iter;                                                        
0118.41             When DVPWD = *blanks;                                          
0118.42               *in99 = *on;                                                 
0118.43               UPWDMSG = 'Enter new password again to verify';              
0118.44             When not (DNEWPWD = DVPWD);                                    
0118.45               *in99 = *on;                                                 
0118.46               UPWDMSG = 'New and Verify Passwords are different';          
0118.47               iter;                                                        
0118.48             Other;                                                         
0118.49               ExSr $CheckSr;                                               
0118.50               Chain DID LOGINPF;                                           
0118.51               If %found();                                                 
0118.52                 ID = DID;                                                  
0118.53                 PWD = DVPWD;                                               
0118.54                 Update LOGINPFR;                              
0118.55                 DID = 0;                                      
0118.56                 DCURPWD = *blanks;                            
0118.57                 DNEWPWD = *blanks;                            
0118.58                 DVPWD = *blanks;                              
0118.59                 UPWDMSG = 'Password updated successfully';    
0118.60               EndIf;                                          
0118.61             EndSl;                                            
0118.62             Else;                                             
0118.63               UPWDMSG = 'User ID not Found';                  
0118.64             EndIf;                                            
0118.65         EndDo;                                                
0118.66         *in03 = *off;                                         
0118.67       EndSr;                                                  
0118.68                                                               
0118.69        BegSr $ClearMngSr;                   
0118.70          *in55 = *off;                      
0118.71          Write MNGCTL;                      
0118.72          *in55 = *on;                       
0118.73          RRN6 = 0;                          
0118.74        EndSr;                               
0118.75                                             
0118.76        BegSr $LoadMngSr;                    
0118.77          Setll *loval EMPMASTER;            
0118.78          Read EMPMASTER;                    
0118.79          Dow not %eof(EMPMASTER);           
0118.80            RRN6 = RRN6 + 1;                 
0118.81            Write MNGDATA;                   
0118.82            Read EMPMASTER;                  
0118.83          Enddo;                             
0118.84       // Clear MSGFOOT;                     
0118.85        EndSr;                               
0118.86                                             
0118.87        BegSr $ManagerDataSr;                
0118.88          Clear OPT;                         
0118.89          Clear ERRMSG5;                                  
0118.90          DoW *in03 = *off;                               
0118.91            ExFmt MNGCTL;                                 
0118.92            ReadC MNGDATA;                                
0118.93            Select;                                       
0118.94            When *in05 = *on;                             
0118.95              *in05 = *off;                               
0118.96              Clear OPT;                                  
0118.97              Clear ERRMSG5;                              
0118.98            When *in12 = *on;                             
0118.99              *in12 = *off;                               
0119.00              LeaveSr;                                    
0119.01            When OPT = 5;                                 
0119.02              Chain ID EMPMASTER;                         
0119.03              If %found();                                
0119.04              ExFmt VIEWRCD;                              
0119.05              EndIf;                                      
0119.06              iter;                                       
0119.07            When OPT <> 0 and OPT <> 5;                   
0119.08              ERRMSG5 = 'Wrong option';                   
0119.09              iter;                                   
0119.10            EndSl;                                    
0119.11            OPT = 0;                                  
0119.12          EndDo;                                      
0119.13          *in03 = *off;                               
0119.14        EndSr;                                        
0119.15                                                      
0119.16        BegSr $ClearLeaveADSr;                        
0119.17          *in57 = *off;                               
0119.18          Write LVADCTL;                              
0119.19          *in57 = *on;                                
0119.20          RRN8 = 0;                                   
0119.21        EndSr;                                        
0119.22                                                      
0119.23        BegSr $LoadLeaveADSr;                         
0119.24          Setll *loval LEAVESPF;                      
0119.25          Read LEAVESPF;                              
0119.26          Dow not %eof(LEAVESPF);                     
0119.27                                                      
0119.28            RRN8 = RRN8 + 1;                          
0119.29            LVSTATUS = STATUS;                 
0119.30            LVID = ID;                         
0119.31            LVFDATE = FDATE;                   
0119.32            LVTDATE = TDATE;                   
0119.33    //      LVREASON = REASON;                 
0119.34            LVTOTAL = TOTAL;                   
0119.35   //       LVFDAY = FDAY;                     
0119.36   //       LVTDAY = TDAY;                     
0119.37   //       LVTYPE = TYPE;                     
0119.38            Chain ID EMPMASTER;                
0119.39            If %found(EMPMASTER);              
0119.40              LVNAME = NAME;                   
0119.41            EndIf;                             
0119.42            Write LVADDATA;                    
0119.43            Read LEAVESPF;                     
0119.44          Enddo;                               
0119.45        EndSr;                                 
0119.46                                               
0119.47        BegSr $ManagerLeaveSr;                 
0119.48          Clear OPT;                           
0119.49          Clear ERRMSG5;                                   
0119.50          DoW *in03 = *off;                                
0119.51            Write HEADER;                                  
0119.52            Write FOOTER;                                  
0119.53            ExFmt LVADCTL;                                 
0119.54            ReadC LVADDATA;                                
0119.55            Select;                                        
0119.56            When *in05 = *on;                              
0119.57              *in05 = *off;                                
0119.58              Clear OPT;                                   
0119.59              Clear ERRMSG5;                               
0119.60            When *in12 = *on;                              
0119.61              *in12 = *off;                                
0119.62              LeaveSr;                                     
0119.63            When OPT = 1 and LVSTATUS = 'P';               
0119.64              Clear OPT;                                   
0119.65              ExSr $ApproveLeaveSr;                        
0119.66              ExSr $ClearLeaveADSr;                        
0119.67              ExSr $LoadLeaveADSr;                         
0119.68              Write FOOTER;                                
0119.69              iter;                                                                     
0119.70            When OPT = 2 and LVSTATUS = 'P';                                            
0119.71              Clear OPT;                                                                
0119.72              ExSr $DenyLeaveSr;                                                        
0119.73                ExSr $ClearLeaveADSr;                                                   
0119.74                ExSr $LoadLeaveADSr;                                                    
0119.75                Write FOOTER;                                                           
0119.91              iter;                                                                     
0119.92            When OPT = 5;                                                               
0119.93              OPT = 0;                                                                  
0119.94              Chain ID LEAVESPF;                                                        
0119.95              If %found();                                                              
0119.96                ExSr $LeaveDescSr;                                                      
0119.97              EndIf;                                                                    
0119.98              iter;                                                                     
0119.99            When (OPT = 1 or OPT = 2 or OPT = 5) and LVSTATUS <> 'P';                   
0120.00              Clear OPT;                                                                
0120.01              ERRMSG5 = 'Cannot take action';                                           
0120.02              iter;                                                                     
0120.03            When OPT <> 0 and OPT <> 5 and OPT <> 1 and OPT <> 2;                       
0120.04              Clear OPT;                                  
0120.05              ERRMSG5 = 'Wrong option';                   
0120.06              iter;                                       
0120.07            EndSl;                                        
0120.08            OPT = 0;                                      
0120.09          EndDo;                                          
0120.10          *in03 = *off;                                   
0120.11        EndSr;                                            
0120.12                                                          
0120.13        BegSr $LeaveDescSr;                               
0120.14          Clear OPT;                                      
0120.15          Clear LEAVEDESC;                                
0120.16          Clear LVDESCMSG;                                
0120.17          DoW *in03 = *off;                               
0120.18            DLID = LVID;                                  
0120.19            DLNAME = LVNAME;                                                   
0120.20            DLFDATE = LVFDATE;                  
0120.21            DLTDATE = LVTDATE;                  
0120.22            DLTOTAL = LVTOTAL;                  
0120.23            DLSTATUS = LVSTATUS;                
0120.24      //    Chain DLID LEAVESPF;                
0120.25            Setll DLID LEAVESPF;                
0120.26            Reade DLID LEAVESPF;                
0120.27     //     If %found();                        
0120.28            DoW not %eof(leavespf);             
0120.29            If DLFDATE = FDATE;                 
0120.30            DLFDAY = FDAY;                      
0120.31            DLTDAY = TDAY;                      
0120.32            DLTYPE = TYPE;                      
0120.33            DLREASON = REASON;                  
0120.34            leave;                              
0120.35            else;                               
0120.36            Reade DLID leavespf;                
0120.37            endif;                              
0120.38            enddo;                         
0120.39    //      EndIf;                         
0120.40            Chain DLID LEAVEBALPF;         
0120.41            If %found();                   
0120.42              DLBAL = CL + EL + COL;       
0120.43            EndIf;                         
0120.44            ExFmt LEAVEDESC;               
0120.45            Select;                        
0120.46              When *in05 = *on;            
0120.47                *in05 = *off;              
0120.48                Clear LVDESCMSG;           
0120.49                Clear SELLV;               
0120.50              When *in12 = *on;            
0120.51                *in12 = *off;              
0120.52                LeaveSr;                   
0120.53              When SELLV = '1';            
0120.54                Clear SELLV;               
0120.55                ExSr $ApproveLeaveSr;      
0120.56                iter;                      
0120.57              When SELLV = '2';                    
0120.58                Clear SELLV;                       
0120.59                ExSr $DenyLeaveSr;                 
0120.60                iter;                              
0120.61              When SELLV <> '1' and SELLV <> '2';  
0120.62                Clear SELLV;                       
0120.63                Clear OPT;                         
0120.64                LVDESCMSG = 'Wrong Option';        
0120.65                iter;                              
0120.66            EndSl;                                 
0120.67            ExSr $ClearLeaveADSr;                  
0120.68            ExSr $LoadLeaveADSr;                   
0120.69            write FOOTER;                          
0120.70          EndDo;                                   
0120.71          *in03 = *off;                            
0120.72        EndSr;                                     
0120.73                                                   
0120.74       BegSr $ApproveLeaveSr;                      
0120.75         LVSTATUS = 'A';                           
0120.76         DLSTATUS = 'A';                           
0120.77         Setll LVID LEAVESPF;           
0120.78         Reade LVID LEAVESPF;           
0120.79         Dow not %eof(leavespf);        
0120.80         If LVFDATE = FDATE;            
0120.81           STATUS = LVSTATUS;           
0120.82           STATUS = DLSTATUS;           
0120.83           Update LEAVESR;              
0120.84           leave;                       
0120.85         else;                          
0120.86           reade LVID leavespf;         
0120.87         EndIf;                         
0120.88         Enddo;                         
0120.89       EndSr;                           
0120.90                                        
0120.91       BegSr $DenyLeaveSr;              
0120.92         DLSTATUS = 'D';                
0120.93         LVSTATUS = 'D';                
0120.94         TempLeaveType = TYPE;          
0120.95         Setll LVID LEAVESPF;           
0120.96         Reade LVID LEAVESPF;           
0120.97         Dow not %eof(leavespf);         
0120.98         If LVFDATE = FDATE;             
0120.99           STATUS = DLSTATUS;            
0121.00           STATUS = LVSTATUS;            
0121.01           Update LEAVESR;               
0121.02           Leave;                        
0121.03         Else;                           
0121.04           reade LVID leavespf;          
0121.05         EndIf;                          
0121.06         EndDO;                          
0121.07         Chain ID LEAVEBALPF;            
0121.08         If %found(LEAVEBALPF);          
0121.09           If TempLeaveType = 'CL';      
0121.10             CL = CL + 1;                
0121.11           ElseIf TempLeaveType = 'EL';  
0121.12             EL = EL + 1;                
0121.13           Else;                         
0121.14             COL = COL + 1;              
0121.15           EndIf;                        
0121.16           Update LEAVEBPFR;             
0121.17         EndIf;                        
0121.18         ExSr $ClearLeaveADSr;         
0121.19         ExSr $LoadLeaveADSr;          
0121.20         Write FOOTER;                 
0121.21       EndSr;                          
0121.22                                       
0121.23        BegSr $ClearCompADSr;          
0121.24          *in56 = *off;                
0121.25          Write COMPDSCTL;             
0121.26          *in56 = *on;                 
0121.27          RRN7 = 0;                    
0121.28        EndSr;                         
0121.29                                       
0121.30        BegSr $LoadCompADSr;           
0121.31          Setll *loval COMPOFFPF;      
0121.32          Read COMPOFFPF;              
0121.33          Dow not %eof(COMPOFFPF);     
0121.34            RRN7 = RRN7 + 1;           
0121.35            COMPSTATUS = STATUS;       
0121.36            Chain COMPID EMPMASTER;    
0121.37            If %found(EMPMASTER);     
0121.38              COMPNAME = NAME;        
0121.39            EndIf;                    
0121.40            Write COMPDSDATA;         
0121.41            Read COMPOFFPF;           
0121.42          Enddo;                      
0121.43        EndSr;                        
0121.44                                      
0121.45        BegSr $ManagerCompSr;         
0121.46          Clear OPT;                  
0121.47          Clear ERRMSG5;              
0121.48          DoW *in03 = *off;           
0121.49            Write HEADER;             
0121.50            Write FOOTER;             
0121.51            ExFmt COMPDSCTL;          
0121.52            ReadC COMPDSDATA;         
0121.53            Select;                   
0121.54            When *in05 = *on;         
0121.55              *in05 = *off;                    
0121.56              Clear OPT;                       
0121.57              Clear ERRMSG5;                   
0121.58            When *in12 = *on;                  
0121.59              *in12 = *off;                    
0121.60              LeaveSr;                         
0121.61            When OPT = 1 and COMPSTATUS = 'P'; 
0121.62              OPT = 0;                         
0121.63              ExSr $ApproveCompSr;             
0121.64              iter;                            
0121.65            When OPT = 2 and COMPSTATUS = 'P'; 
0121.66              OPT = 0;                         
0121.67              ExSr $DenyCompSr;                
0121.68              ExSr $ClearCompADSr;             
0121.69              ExSr $LoadCompADSr;              
0121.70              iter;                            
0121.71            When OPT = 5;                      
0121.72              OPT = 0;                         
0121.73              ExSr $CompDescSr;                
0121.74              iter;                            
0121.75            EndSl;                     
0121.76            Clear OPT;                 
0121.77            ExSr $ClearCompADSr;       
0121.78            ExSr $LoadCompADSr;        
0121.79    //      Write FOOTER;              
0121.80          EndDo;                       
0121.81          *in03 = *off;                
0121.82        EndSr;                         
0121.83                                       
0121.84        BegSr $CompDescSr;             
0121.85          Clear COMPDESC;              
0121.86          Clear OPT;                   
0121.87          Dow *in03 = *off;            
0121.88            Write HEADER;              
0121.89            Write FOOTER;              
0121.90            DCSTATUS = COMPSTATUS;     
0121.91            DCNAME = COMPNAME;         
0121.92            DCID = COMPID;             
0121.93            DCDAY = COMPDAY;           
0121.94            DCDATE = COMPDATE;         
0121.95            Chain DCID COMPOFFPF;                                      
0121.96            If %found();                                               
0121.97              DCREASON = REASON;                                       
0121.98              DCPID = PROJECTID;                                       
0121.99            EndIf;                                                     
0122.00            ExFmt COMPDESC;                                            
0122.01            Select;                                                    
0122.02            When SELCOMP = '1';                                        
0122.03              Clear SELCOMP;                                           
0122.04              ExSr $ApproveCompsr;                                     
0122.05              iter;                                                    
0122.06            When SELCOMP = '2';                                        
0122.07              Clear SELCOMP;                                           
0122.08              ExSr $DenyCompSr;                                        
0122.09              iter;                                                    
0122.10              When SELLV <> *blanks and SELLV <> '1' and SELLV <> '2'; 
0122.11                LVDESCMSG = 'Wrong Option pressed';                    
0122.12                iter;                                                  
0122.13            EndSl;                                                     
0122.14          EndDo;                                                       
0122.15          *in03 = *off;                               
0122.16        EndSr;                                        
0122.17                                                      
0122.18        BegSr $ApproveCompSr;                         
0122.19          If DCSTATUS = 'P' or COMPSTATUS = 'P';      
0122.20                DCSTATUS = 'A';                       
0122.21                COMPSTATUS = 'A';                     
0122.22                Chain COMPID COMPOFFPF;               
0122.23                If %found();                          
0122.24                  STATUS = DCSTATUS;                  
0122.25                  STATUS = COMPSTATUS;                
0122.26                  Update COMPOFFPFR;                  
0122.27                EndIf;                                
0122.28           EndIf;                                     
0122.29            //  ExSr $ClearCompADSr;                  
0122.30           //   ExSr $LoadCompADSr;             
0122.31           //   Write FOOTER;                   
0122.32       EndSr;                                   
0122.33                                                
0122.34       BegSr $DenyCompSr;                       
0122.35              If DCSTATUS = 'P';                
0122.36                DCSTATUS = 'D';                 
0122.37                COMPSTATUS = 'D';               
0122.38                Chain COMPID COMPOFFPF;         
0122.39                If %found();                    
0122.40                  STATUS = DCSTATUS;            
0122.41                  STATUS = COMPSTATUS;          
0122.42                  Update COMPOFFPFR;            
0122.43                  Clear COMPDESC;               
0122.44                  DCSTATUS = COMPSTATUS;        
0122.45                  DCNAME = COMPNAME;                  
0122.46                  DCID = COMPID;                      
0122.47                  DCDAY = COMPDAY;                    
0122.48                  DCDATE = COMPDATE;                  
0122.49                  DCREASON = REASON;                  
0122.50                EndIf;                                
0122.51              EndIf;                                  
0122.52       EndSr;                                         
0122.53       Begsr $CheckSr;                                
0122.54         *in13 = *off;                                
0122.55         *in14 = *off;                                
0122.56         *in15 = *off;                                
0122.57         *in25 = *off;                                
0122.58         *in26 = *off;                                
0122.59         *in27 = *off;                                
0122.60         *in28 = *off;                                
0122.61         *in29 = *off;                                
0122.62         *in30 = *off;                                
0122.63         *in31 = *off;                                
0122.64         *in32 = *off;                                
0122.65         *in33 = *off;      
0122.66         *in34 = *off;      
0122.67         *in35 = *off;      
0122.68         *in36 = *off;      
0122.69         *in37 = *off;      
0122.70         *in38 = *off;      
0122.71         *in39 = *off;      
0122.72         *in40 = *off;      
0122.73         *in41 = *off;      
0122.74         *in42 = *off;      
0122.75         *in61 = *off;      
0122.76         *in62 = *off;      
0122.77         *in63 = *off;      
0122.78         *in64 = *off;      
0122.79         *in65 = *off;      
0122.80         *in91 = *off;      
0122.81         *in93 = *off;      
0122.82         *in94 = *off;      
0122.83         *in95 = *off;           
0122.84         *in96 = *off;           
0122.85         *in97 = *off;           
0122.86         *in98 = *off;           
0122.87         *in99 = *off;           
0122.88       EndSr;                    
0122.89                                 
0122.90       BegSr $EmpDetailSr;       
0122.91         DNAME = *BLANKS;        
0122.92         DGEN = *BLANKS;         
0122.93         DCITY = *BLANKS;        
0122.94         DADD = *BLANKS;         
0122.95         DNUM = 0;               
0122.96         DDOB = 0;               
0122.97         DDOJ = 0;               
0122.98         DCOUNTRY = *BLANKS;     
0122.99         DDSG = *BLANKS;         
0123.00         DPIN = 0;               
0123.01         DENUM = 0;              
0123.02         DPID = *BLANKS;         
0123.03         DMID = 0;                              
0123.04         DTEAM = *BLANKS;                       
0123.05         DEMAILO = *BLANKS;                     
0123.06         DEMAILP = *BLANKS;                     
0123.07         DSTATUS = *BLANKS;                     
0123.08         DROLE = *BLANKS;                       
0123.09       EndSr;                                   
0123.10                                                
0123.11       BegSr $DateCheckSr;                      
0123.12         Select;                                
0123.13         When DCOMPDATE <> 0;                   
0123.14           Test(DE) *ISO DCOMPDATE;             
0123.15           If %error();                         
0123.16             *in91 = *on;                       
0123.17             Flag = *on;                        
0123.18             ERRCOMP = 'Invalid Date';          
0123.19           Elseif %date(DCOMPDATE) > %date();   
0123.20             *in91 = *on;                       
0123.21             flag = *on;                        
0123.22             ERRCOMP = 'Date should be less than current date';              
0123.23           ElseIf %date(DCOMPDATE) <= %date;                                 
0123.24             date1 = %date(DCOMPDATE);                                       
0123.25             days_num = %diff(%date:date1: *days);                           
0123.26             months_num = %diff(%date:date1: *months);                       
0123.27             if (days_num > 91 or months_num > 4);                           
0123.28               *in91 = *on;                                                  
0123.29               Flag = *on;                                                   
0123.30               ERRCOMP = 'Comp Off date should not be less than 3 months';   
0123.31             endif;                                                          
0123.32           Else;                                                             
0123.33             Clear ERRCOMP;                                                  
0123.34           EndIf;                                                            
0123.35           Flag = *off;                                                      
0123.36                                                                             
0123.37         When DDATE <> 0;                                                    
0123.38           Test(DE) *ISO DDATE;                                              
0123.39           If %error();                                                      
0123.40             *in13 = *on;                                                    
0123.41             Flag = *on;                                                     
0123.42             ERRMSG4 = 'Invalid Date';               
0123.43           else;                                     
0123.44             *in13 = *off;                           
0123.45             Clear ERRMSG4;                          
0123.46           EndIf;                                    
0123.47                                                     
0123.48         When DFDATE <> 0;                           
0123.49           Test(DE) *ISO DFDATE;                     
0123.50           If %error();                              
0123.51             *in61 = *on;                            
0123.52             Flag = *on;                             
0123.53             APPLVMSG2 = 'Invalid Date';             
0123.54           ElseIf %date(DFDATE) <= %date();          
0123.55             *in61 = *on;                                          
0123.56             APPLVMSG2 = 'Cannot apply for previous month or days';
0123.57           else;                                                   
0123.58             *in61 = *off;                                         
0123.59             Clear APPLVMSG2;                                      
0123.60           EndIf;                                                  
0123.61           Chain DFDATE HOLIDAYPF;                                 
0123.62           If %found(HOLIDAYPF);                                   
0123.63             APPLVMSG2 = 'Cannot apply on Holiday';                
0123.64           Else;                                                   
0123.65             *in61 = *off;                                         
0123.66             Clear APPLVMSG2;                                      
0123.67           EndIf;                                                  
0123.68           Flag = *off;                                            
0123.69                                                                   0123.70         When DDOB <> 0;                                       
0123.71           Test(DE) *ISO DDOB;                                 
0123.72           If %error();                                        
0123.73             *in28 = *on;                                      
0123.74             Flag = *on;                                       
0123.75             ERRMSG1 = 'Invalid Date';                         
0123.76           ElseIf %date(DDOB) >= %date();                      
0123.77             *in28 = *on;                                      
0123.78             Flag = *on;                                       
0123.79             ERRMSG1 = 'DOB should be less than current date'; 
0123.80           ElseIf %date(DDOB) < %date();                       
0123.81             date1 = %date(DDOB);                              
0123.82             years_num = %diff(%date(): date1: *years);        
0123.83             If years_num < 18;                                           
0123.84               ERRMSG1 = 'Age is not 18 or above, hence DOB not valid';   
0123.85               *in28 = *on;                                               
0123.86               Flag = *on;                                                
0123.87             Else;                                                        
0123.88               *in28 = *off;                                              
0123.89               Clear ERRMSG1;                                             
0123.90             EndIf;                                                       
0123.91           EndIf;                                                         
0123.92           Flag = *off;                                                   
0123.93         EndSl;                                                           
0123.94       EndSr;                                                             
0123.95                                                                          
0123.96       BegSr $DateCheckSr1;                                               
0123.97         Select;                                                          
0123.98         When DDOB <> 0 and DDOJ <> 0;                                    
0123.99           Test(DE) *ISO DDOJ;                                            
0124.00           If %error();                                                   
0124.01             *in29 = *on;                                                 
0124.02             Flag2 = *on;                                                 
0124.03             ERRMSG1 = 'Invalid Date';                                        
0124.04           ElseIf %date(DDOJ) <= %date(DDOB);                                 
0124.05             *in29 = *on;                                                     
0124.06             Flag2 =*on;                                                      
0124.07             ERRMSG1 = 'Date of Joining should be greater than DOB';          
0124.08           Else;                                                              
0124.09             *in29 = *off;                                                    
0124.10             Clear ERRMSG1;                                                   
0124.11           Endif;                                                             
0124.12           Flag2 = *off;                                                      
0124.13         When DTDATE <> 0;                                                    
0124.14           Test(DE) *ISO DTDATE;                                              
0124.15           If %error();                                                       
0124.16             *in62 = *on;                                                     
0124.17             Flag2 = *on;                                                     
0124.18             APPLVMSG2 = 'Invalid Date';                                      
0124.19           ElseIf %date(DTDATE) < %date(DFDATE);                              
0124.20             *in62 = *on;                                                     
0124.21             Flag2 = *on;                                                     
0124.22             APPLVMSG2 = 'To Date should not be less than from date';         
0124.23           ElseIf %date(DTDATE) > %date();                                  
0124.24             *in62 = *off;                                                  
0124.25             days_num = %diff(%date(DTDATE): %date(DFDATE): *days);         
0124.26           else;                                                            
0124.27             *in62 = *off;                                                  
0124.28             Clear APPLVMSG2;                                               
0124.29           EndIf;                                                           
0124.30           Chain DTDATE HOLIDAYPF;                                          
0124.31           If %found(HOLIDAYPF);                                            
0124.32             APPLVMSG2 = 'Cannot apply on Holiday';                         
0124.33           Else;                                                            
0124.34             *in62 = *off;                                                  
0124.35             Clear APPLVMSG2;                                               
0124.36           EndIf;                                                           
0124.37           Flag2 = *off;                                                    
0124.38         EndSl;                                                             
0124.39       EndSr;                                                               
0124.40  /end-free                                                                 
0124.41  *                                                                         
                                                        
                                                                                                   
                                      
